"Faculty of Computers and Artificial Intelligence\nWhy do students prefer studying in the Faculty of Computers and Artificial Intelligence? \nThe Faculty of Computers and Artificial Intelligence at Al Ryada University for Science & Technology is a \ndynamic and modern institution offering a diverse range of specializations. The overarching mission of the \nfaculty is to provide Egypt and the Middle East with education of the highest quality, tailored to meet the \nchallenges and opportunities of Industry 4.0 in the 21st century. We aim to prepare graduates who distinguish \nthemselves through the quality and impact of translating knowledge into societal, industrial, and economic \nbenefits. \nThe Faculty of Computers and Artificial Intelligence focuses on the scientific, technical, and human \ndimensions of information technology, where computers play a substantial role. Our commitment extends to \npreparing graduates to develop novel, creative, and effective solutions, emphasizing innovation, \nentrepreneurship, and a proven track record of engagement with the enterprise sector. This engagement \nencompasses technological, industrial, commercial, social, and cultural aspects related to information \ntechnology. \nThe Faculty of Computers and Artificial Intelligence integrates knowledge from various disciplines, including \nScience, Artificial Intelligence, Engineering, Medicine, Economics, Management, Sociology, Law, and \nPsychology. \nOur faculty adopts an innovative and adaptive approach, fostering close partnerships with national and \ninternational academic, research, and industrial organizations. This collaborative effort ensures the delivery of \ndisciplined, organized, creative, and multi-skilled graduates, contributing to society's needs. \nWe take pride in our academic experts, who bring practical experience to the table, creating a friendly and \nhealthy academic environment that encourages diversity and innovation for our students. \nBSc Degrees on Computers and Artificial Intelligence \nBSc Degrees on Computers and Artificial Intelligence \nThe Faculty of Computers and Artificial Intelligence offers a variety of degree specializations, each with its \nunique emphasis. \nOur students graduate with a degree in Computers and Artificial Intelligence in one of the following \nspecializations: \n• Computer Science – Mobile Programming \n• Computer Science – Computer & Software Security \n• Artificial Intelligence \n• Medical Informatics \nWhile all degrees include core modules focusing on computing, programming, and information technology, \nstudents will also develop skills in communication, teamwork, project management, leadership, and, in a \nrapidly evolving field, how to be effective lifelong learners. \nOur degree programs are characterized by: \n• A range of specializations that address global IT market needs. \n• A blend of theory and practice to closely align with industry requirements, providing immediate \nprofessional value to what our students learn. \n• Research-oriented and hands-on experience subjects integrated into the degree programs. \n• Regular updates to subjects to reflect changes in the Information and Communication Technology \n(ICT) domain. \n• Highly qualified academic staff with both international and Egyptian experience. \n• Access to state-of-the-art computer facilities. \n• A focus on employability to give our graduates a competitive edge in the workplace, whether working \nin small companies or large organizations. \n• Opportunities for summer training and internships. \n. \nTHE FACULTY OF COMPUTERS AND ARTIFICIAL INTELLIGENCE \nStudy Plan for the Faculty of Computers & Artificial Intelligence \nFIRST LEVEL/YEAR \nThis  is  where  you  embark  on  your  journey  to  study  computer  science  with  a focus  on  artificial \nintelligence,  acquiring  essential  technical  and  problem-solving  skills  to  address  both  current  and \nemerging challenges in this critical and rapidly evolving field. The program introduces fundamental \nprinciples of Programming and Computation, cultivates Critical Thinking for problem-solving through \ncomputer programs, hones Communication Skills, and includes Technical Writing and Mathematics \ncourses that are foundational for all specializations. \nSOPHOMORE (SECOND LEVEL) \nIn the second year, you will advance from First Year, delving into more complex programming, data \nstructures,  and  database  design.  The  curriculum  will  deepen  your  understanding  of  software \ndevelopment,  data  science  fundamentals,  algorithms,  data  structures,  and  computer  system  design. \nAdditionally, you will explore subjects such as software engineering, internet, and web programming. \nJUNIOR (THIRD LEVEL) \nIn this year, your studies will become more focused, providing you with increased choices in selecting \nspecialized courses. We offer a variety of options tailored to your chosen specialization. In the first \nsemester,  all  specializations  will  cover  fundamentals  of  artificial  intelligence,  computer  networks, \ncomputer  security,  and  operating  systems. The  second  semester  allows  you  to  deepen  your \nunderstanding  of  your  specialization  through  courses  such  as  Internet  of  Things  (IoT),  Machine \nLearning, Embedded Systems, Data Mining, Natural Language Processing (NLP), Human Physiology, \nMedical Text Processing, and Clinical Informatics. \nSENIOR (FROURTH LEVEL) \nIn  the  final  year,  you'll  select  from  a  diverse  range  of  advanced  specialized  courses  in  Mobile \nProgramming,  Cyber  Security,  Artificial  Intelligence,  and  Medical  Informatics.  Fourth  Year  also \nencompasses an individual Honors Final Year Project, where you will develop a viable project based \non a given topic. You'll have a range of choices in selecting your topics, with a dedicated supervisor \nto guide you. \n Information Technology (IT) continues to reshape the way we live, play, and conduct business. Unsurprisingly, \na career in IT stands out as one of the most sought-after paths in the modern workforce. The dominance of IT \ncareers is attributed to various factors, including the rapid growth of the Internet and e-commerce, the heightened \ndemand for information security specialists amid escalating cyber-attacks, the emergence of smarter mobile and \nweb applications enabling companies to analyze business data for unprecedented intelligence, the revolutionary \nimpact of cloud computing on IT department operations, and the widespread use of mobile devices. \nOpportunities with attractive salaries are virtually limitless in the fields of Mobile Programming, Artificial \nIntelligence, Cybersecurity, and Medical Informatics. Studying in the Faculty of Computers and Artificial \nIntelligence provides you with various potential career options based on your specialization, including the \nfollowing: \n1- Graduates of Computer Science – Programming Track may find employment in various roles, including \nbut not limited to: \n• Software Engineer. • Software Tester. \n• Mobile Application \nDeveloper. \n• Front-End, Back-End, and Full-\nStackWeb Developer. \n• User Interface Developer. • Computer Programmer. \n• DevOps Engineer. • Database Administrator. \n• Video Game Designer. • Graphic Designer. \n• Computer Vision Engineer. • Computer Systems Analyst. \n• System Analyst and \nDesigner \n• Information Technology Manager. \n• Computer Scientist. • Cloud Engineer. \n• IT Project Manager. • Chief Information Officer. \n2- Graduates of Computer Science – Cybersecurity Track may find employment in various roles, \nincluding but not limited to: \n• Security Engineer. • Security Architecture. \n• Application Security \nEngineer. \n• Cryptography Engineer. \n• Intrusion Detection \nSpecialist. \n• Information Security Analyst. \n• Cybersecurity Analyst. • Information Security Specialist. \n• Malware Analyst. • Digital Forensic Examiner. \n• Penetration Tester.  • Ethical Hacker. \n• Incident Response Analyst. • Computer Forensics Analyst. \n• Cloud Security Specialist. • Cybersecurity Managers. \n• Security Systems \nAdministrator. \n• Security Consultants. \n• Chief Information Security \nOfficer (CISO). \nCareer Opportunities \n3- Graduates of Artificial Intelligence may find employment in various roles, including but not limited to: \n• AI Engineer. • AI Architect. \n• Artificial Intelligence \nApplication Developer. \n• Business Intelligence Developer. \n• Machine Learning Engineer. • Machine Learning Architect. \n• Data Scientist. • Data Architect. \n• Data Analyst. • Computer Vision Engineer. \n• NLP Engineer. • Neural Network Developer. \n• Business Intelligence \nDeveloper. \n• Cloud Engineer. \n• Big Data Engineer. \n• Big Data Architect. \n• Data Mining and Analysis. • Data Engineer. \n4- Graduates of Medical Informatics may find employment in various roles, including but not limited to:  \n• Clinical Informatics \nSpecialist. \n• Medical Coding \nSpecialist. \n• Health Informatics \nConsultant. \n• Health data analytics. \n• Clinical Informatics \nSpecialist. \n• Machine Learning \nArchitect. \n• Health Informatics \nSpecialist. \n• Health  Data architect. \n• Nursing informatics \nspecialists. \n• Clinical Informatics \nData Analyst. \n• Chief Medical Officer. • Health informatics \nconsultants. \nExtraordinary Entrepreneurs \nOur exceptional students will leverage the power of data and artificial intelligence to revolutionize various \nsectors, ranging from healthcare to energy provision. Their innovative ideas carry the potential not only to \nreshape our country but also to influence the region and even the world. \nTogether, we embrace change, adapting and collaborating in novel ways that challenge the status quo and \nredefine established modes of thinking. Without boundaries, our students, academics, and researchers converge \nwith the public and private sectors, fostering an environment where they learn from each other and collaborate \nseamlessly to generate groundbreaking solutions. \n.” \nHow to apply the Faculty of Computers and Artificial Intelligence  \n(i) Read the admissions section in the  website www.rst.edu.eg . This can also be downloaded at \nwww.rst.edu.eg \n(ii) Submit an application online at www.rst.edu.eg \n(iii) Call the RST Hotline and speak to a member of staff in the Student Affairs Department in you \nrequire further information- 16504 \n When to apply:  \n(i) Admission is currently open. \n(ii) Applicants are encouraged to apply early in order to secure a place in their chosen program of study. \n(iii) Once programs are full the applicants will be placed on a waiting list. \n      For more details, visit the faculty website: www.rst.edu.eg \nWhat’s next?  \nVirtual Visit  \nCan’t get to Al Rayad in  person?  Our  Virtual \nVisit   allows   you   to   virtually   explore   the \nUniversity.   View   a   range   of   videos,   360° \nphotos and image galleries to find out what it \nis like to live and study here: \nvirtualvisits.rst.edu.eg/undergraduate \nChat online  \nWherever you are, we give you the chance to \nchat to us about anything related to your \nadmission. You will be able to ask about \ndifferent subjects:  \n------------------/student-chat  \nContact us \nOur prospective students’ Enquiry Team can advise you \nabout admission to specific degrees or help if you have \ngeneral enquiries about applying to the University:  \nfuturestudents@rst.edu.eg \n "